{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_32", "trainable": true, "batch_input_shape": [null, 1, 128, 128], "input_dtype": "float32", "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_32", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_33", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_33", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_34", "trainable": true, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_34", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"name": "flatten_14", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_41", "trainable": true, "output_dim": 32, "init": "glorot_uniform", "activation": "sigmoid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 25088}}, {"class_name": "Dense", "config": {"name": "dense_42", "trainable": true, "output_dim": 64, "init": "glorot_uniform", "activation": "sigmoid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 32}}, {"class_name": "Dense", "config": {"name": "dense_43", "trainable": true, "output_dim": 128, "init": "glorot_uniform", "activation": "sigmoid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 64}}, {"class_name": "Dense", "config": {"name": "dense_44", "trainable": true, "output_dim": 3, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 128}}], "keras_version": "1.2.0"}